jQuery(document).ready(function () {
    // jumpPageNoAuthorityForHandlerNoContainer("/highchat/testChat",function(data) {
    //     console.log(data.data)
    //     var chart = new Highcharts.Chart('container',data.data);
    // });
    Highcharts.setOptions({ global: { useUTC: false } });
    $('#container').highcharts({
        chart: {
            type: 'spline'
        },
        title: {
            text: '某地积雪厚度监测'
        },
        subtitle: {
            text: '非规律性时间内的变化'
        },
        xAxis: {
            type: 'datetime',
            title: {
                text: null
            },
            dateTimeLabelFormats:{hour:"%H:%M"}
        },
        yAxis: {
            title: {
                text: '积雪 厚度 (m)'
            },
            min: 0
        },
        tooltip: {
            xDateFormat: '%Y-%m-%d %H:%M',
            headerFormat: '<b>{point.key}</b><br>',
            pointFormat: '{series.name}:{point.y:.2f} mmHg'
        },
        plotOptions: {
            spline: {
                marker: {
                    enabled: true
                }
            }
        },
        series: [{"name":"心率","data":[{x:1496364082000,y:88},[1496364240000,87],[1496364540000
            ,84],[1496366635000,95],[1496386784000,70],[1496386953000,88],[1496387111000,73],[1496387422000,77],
            [1496387951000,68],[1496388175000,90],[1496388480000,88],[1496415093000,91],[1496418780000,77],[1496426193000
                ,95],[1496426902000,89],[1496445633000,87]],"type":"column"},{"name":"收缩压","data":[[1496364082000,98
        ],[1496364240000,93],[1496364540000,91],[1496366635000,89],[1496386784000,64],[1496386953000,62],[1496387111000
            ,73],[1496387422000,78],[1496387951000,62],[1496388175000,53],[1496388480000,76],[1496415093000,75],
            [1496418780000,75],[1496426193000,90],[1496426902000,101],[1496445633000,83]],"type":"spline"},{"name"
            :"舒张压","data":[[1496364082000,137],[1496364240000,136],[1496364540000,137],[1496366635000,132],[1496386784000
            ,124],[1496386953000,111],[1496387111000,121],[1496387422000,125],[1496387951000,101],[1496388175000
            ,104],[1496388480000,128],[1496415093000,135],[1496418780000,121],[1496426193000,138],[1496426902000
            ,149],[1496445633000,132]],"type":"spline"}]
    });
})